[language]

;Language name 

name=English

;------------------------------------
[tips]


UACtips=Whether to add dockmod to bypass UAC will not prompt user account control in the pop-up window!
firsttip=This software does not charge any fees and is strictly prohibited for commercial purposes. I will not be responsible for any losses.
dwmerror=It is detected that the system has not started the DWM service, and the program cannot run normally!
crashtip=The program has crashed, restart it?
;------------------------------------

[iconame]

;dock Label name

finder=Finder
launchpad=Launchpad
cal=Calendar
trash=Trash

;The last icon in the folder interface

explorer=Open in Finder
return=Back to previous

;System time icon label name format

timeformat=yyyy/M/d/ dddd
;The time format is the system time format   y 年 m月份 d 日期 dddd 星期几  ddd周几


remove=Remove
addtopad=Add to Launchpad
iconisfull=The current page icon is full

;------------------------------------------------------------

[systemicon]
;System icon name
controlpanel=Control Panel
taskbar=Tray icon
systemtime=System Time
cortana=Cortana
network=Network Neighborhood
mydocument=My Document
weather=Weather
battery=Battery

errortips=This icon has been added!


------------------------------------

[editicon]
;Edit icon window

addtips=Files can be dragged and dropped here

reset=Reset
ok=Ok
restore=Restore
addname=Edit display name
addicotips=Click the "..." button in the upper right corner to add an icon
switch=Switch
trashempty=Trash empty
trashfull=Trash full
iconshell=Use icon mask
addline=Run command
;Pop up select file window title

selectfoldertitle=Select folder
;Weather forecast search city
searchcity=Search city name


;------------------------------------

[editcal]

;Edit calendar window

monthfont=Month font:
dayfont=Date font:
monthpoint=Month location:
daypoint=Date location:
monthposition=Month alignment:
dayposition=Date alignment:
monthcolor=Month color:
daycolor=Date color:
rotation=Rotation angle:
default=Use default configuration

ok=Ok
test=Test

left=Left
right=Right
center=Center

;Pop up select picture window title

selectcalicon=Choose a calendar picture

;------------------------------------

[editicontips]
;An error message pops up on the edit icon interface

iconduplicate=This program has been added to the Dock!

systemduplicate=This icon has been added!

titleerror=The program display name cannot be empty!
filepatherror=The program path and icon cannot be empty!

padtitleerror1=The file name is duplicated, please re-enter!
padtitleerror2=File modification failed, please do not put the program on the'C' drive!

formaterror=Unsupported format, please put in png, ico, exe, lnk format!

;---------------------------------------------------------------------------
;Preferences window
[settingUI]

settitle=MyDockFinder Preferences

Global Settings=Global Settings

openMyDock=Open MyDock
openMyFinder=Open MyFinder
MyDockerror=Please open MyDock
MyFindererror=Please open MyFinder

DPIscale=Global interface display scale
Accentcolor=Global interface accent color
darkmodeall=Global interface color mode

darkmode_light=Light
darkmode_dark=Dark
darkmode_auto=Auto
darkmode_system=System

aero=Turn on the global blur effect
systemdarkmode=The system color follows the mydockfinder
autoupdate=Automatically check for program updates
systemstart=Auto start at boot
autohidetaskbar=Automatically hide the taskbar at startup

hidetaskbar_dock=Hides the screen where the taskbar
hidetaskbar_all=Hide all screen taskbars

DirectDXFPS=Select DirectDX rendering refresh rate
languagechoice=Choose program display language
allfont=Choose program font
defaultfont=Default font

general=General
advanced=Advanced
preview=Window preview
minimizewindowsettings=Minimize window

timeset=Time
audioset=Audio
displayset=Display
mediaset=Media
batteryset=Battery
netset=Network
monitorset=Monitor

about=About

icosize=Icon default size
icomaxsize=Icon zoomed size

icospace=Distance between icons
edgeposition=Dock distance from the edge of the screen


displaymode=Select Dock display hidden mode
displaynormal=Default display mode
displaybottom=Overlay display mode
displayauto=Auto hide mode
displaysmart=Smart hide mode
displayhotkey=Hotkey display mode
displayalways=Always show mode
displayhide=Always hide mode

Show activation bar=Show the activation bar after hiding the Dock

positiononscreen=Dock screen position
screenleft=Left
screenbottom=Bottom
screenright=Right
screentop=Top
multiscreen=Select the screen to display the Dock
multiscreenpad=Select the screen to display the Launchpad
padscreenname=Follow Dock
lockicon=Lock icon drag
windowsborder=Turn on window borders to prevent blocking windows
jumpanimation=Click the icon to bounce to open the program
folderDoubleclickOpen=Double-click the folder icon to open
gpurendicon=Use GPU compositing to render Dock icons
iconmask=Add a mask effect to all icons
show indicators=Show indicators for open applications
Runapp separator=Show delimiter for new running program
newapp=Show new running program icon
blacklist=Manage ban list
noblacklist=No prohibition procedure
hotcornerleft=Functions in the lower left corner of the screen
hotcornerright=Functions in the lower right corner of the screen
hotkeypad=Show Launchpad hotkey
hotkeyDock=Show Dock hotkey

dockicobackup=Backup Dock icon file 
backuplist=Manage backup files 
Addbackupdockico=Add icon backup 
locationbackup=Open the backup folder 

minimize=Minimize the window to the Dock
animationoff=Close window minimize animation
Slow animation=Hold down the Shift key to slow down animation
useMipMap=Texture generation MipMap
GDIscreenshot=Minimize screenshots using GDI
screencapturetype=Screenshot types
minimizeeffect=Minimize the window using special effects

genie=Genie
scale=Scale
scaleDX=Scale DX
suck=Suck

Minimize to icon=Minimize windows into application icon
DirectX=Select DirectX version
SamplerState=Minimize texture filtering method (LINEAR is recommended for DX11 and above)
Minimizeblacklist=Cancel minimize animation program
Editwindowlist=Edit window list


previewon=Enable window preview
previewsize=Window preview size
previewdelay=Delayed display preview

previewcontrol=Show other preview elements
previewappname=Application name
previewbutton=Window control buttons
aeropeek=Show full window preview on mouse hover


logotype=Select the button style on the left
diylogo=Select file
shutdownmsgbox=Will pop confirm to restart the system shutdown
finderdark=Choose Finder color mode

finderdark_auto=Wallpaper
finderdark_set=Setting

finderdisplaymode=Select Finder display hidden mode
finderautochangecolor=Maximize the window to use immersive mode

showaudio=Show volume icon in Finder
showbattery=Show battery icon in Finder
showwifi=Show WiFi icon in Finder
showbluetooth=Show Bluetooth icon in Finder
showdisplay=Show Display icon in Finder
showcpu=CPU
showtemp=Coretemp
showmen=MEN
showdisk=DISK
shownet=NETWORK

formatdate=Choose date display format
formattime=Choose time display format

showbatteryvalue=Show Battery Percentage 
audiotip=Play volume change sound
mediatype=Select the volume and brightness prompt style

media_system=System
media_mac=Mac
media_ios=iOS

hotkeyvolup=Volume up hotkey
hotkeyvoldown=Volume down hotkey
hotkeyvolmute=Volume mute hotkey


hotkeybriup=Brightness up hotkey
hotkeybridown=Brightness down hotkey

theme=Theme

wallpaper=Wallpaper

selectwallpaper=Select Wallpaper theme
wallpapernone=None
loadwallpaper=Load wallpaper theme 
wallpaperdownload=Download wallpaper themes 
wallpaperOK=Application 

contribute=Support donations
netdisk=Visit website
updatelog=Update log
update=Check for updates
restartdock=Restart program
uninstall=Uninstall program

ok=Ok
cancel=Cancel

------------------------------------------------------------
[hotcorners]
nothing=nothing
allwindows=Show all windows
launchpad=Show Launchpad
displaytosleep=Turn off the display
startmenu=Show start menu
showdesktop=Show desktop
actioncenter=Windows Operation Center
screensaver=Screen protector

[settingtips]

;An error message pops up on the setting interface
gpurendtip=Enabling this option may cause the computer to crash. Please do not exit the dock. This startup is temporarily enabled. Exiting the dock will save this configuration. If the computer crashes after a period of time, the next startup will automatically cancel the GPU composite rendering.
edgetip=The boundary of the open limit window cannot be adjusted!
autohideerror=This function cannot be enabled when opening the window boundary!
neterror=Network error, please check the connection.
autohide=Auto hide Dock cannot enable this function!
updateerror1=Network error, please try again!
updateerror2=Online update failed. Do you want to open the download page?
updateerror3=Many failed attempts to update, please download the update package from the network disk!

updatetip1=Is there a new version updated?
updatetip2=Is the file updated immediately after downloading?

noupdate=It is the latest version, no need to update!
uninstalltip=Do you want to remove this program from the system?
restarttip=Open after restarting the program!
fontrestart=Some interfaces need to be restarted to change!

languagetips=Some interfaces need to be restarted to change!

uninstallcomplete=After the uninstallation is complete, please manually delete any undeleted files.

DPIerrortip=The current zoom factor is greater than the system zoom interface. The display is too large!

restartruntip=Do you want to restart the program?

backupfolderror=Failed to create the backup folder, please check the directory permissions!

backuptips=Do you want to restore this backup file?


;-------------------------------------------------------------------

[menu]
;Right menu


newfinderwindow=New Finder window
gotofolder=Go to folder...
connecttoserver=Remote Desktop
showlaunchpad=Show Launchpad


addnormalicon=Add normal icon
addsystemicon=Add system icon
showtaskbar=Show taskbar
hidetaskbar=Hide taskbar
preference=Preferences
enddock=End the program

editicon=Set this icon
removefromdock=Remove from Dock
keepindock=Keep in Dock
locationfile=Open file location
runagain=Run this program again
nevershowthis=Do not show this program again
adminmode=Administrator mode operation
open=Open
quit=Quit

emptytrash=Empty the trash
sortorder=sort by
Byname=Name
Bysize=Size
Byextension=Type
Bydate/time=Change the time
Createtime=Creation time
Groupdirectories=Directories first
reverseorder=Reverse sort
closewindow=Close this window
Display=The display content is
Folder=Folder
Stack=Stack
Locatefolder=Directly open
FolderEffect=Display effect
Grid=Grid
Fan=Fan
add delimiter=Add separator
del delimiter=Remove separator

showmodeapps=Set independent display and hide mode
showmodedesktop=Set desktop display and hide mode
NominiEffect=Do not show window minimize animation
showmodenormal=Follow settings
msgtips=Set up a message reminder
incognito=New incognito mode window

systemmenu=System menu

timeskin=Select watch face
timedefault=Default
timeMickey=Mickey
----------------------------------------------

[launchpad]

addicon=Add icon
deleteicon=Delete this icon
search=Search
ok=Ok
addtips=Please drag the exe and lnk files here
----------------------------------------------

[promptwindow]

;Empty trash can prompt and other prompts

ok=Ok
cancel=Cancel
trashok=Empty the trash
trashtitle=Are you sure you want to empty the items in the trash?
batterytip=Please connect the charger if the battery is low!
apperror=The program is damaged, please download again!
eject=has been ejected

-----------------------------------------------
;Time format description
;ddd day of the week dddd day of the week M month d day H 24 hour format h 12 hour format m minutes s seconds
;Double letters with two digits for example  HH:mm:ss  09:06:05
;All the following formats can be customized and modified, and the number on the left can be added without limit = left blank to indicate that the date is not displayed
;After the modification is saved, it will take effect immediately, directly set and click the time format menu to display the effect
[formatdate]
1=
2=ddd
3=MMMd
4=MMMd ddd
5=ddd MMMd

[formattime]
1=H:mm
2=tt h:mm
3=H:mm:ss
4=tt h:mm:ss

[calicon]

;Calendar icon month text

m1=Jan
m2=Feb
m3=Mar
m4=Apr
m5=May
m6=Jun
m7=Jul
m8=Aug
m9=Sep
m10=Oct
m11=Nov
m12=Dec


[findermenu]
bluetooth=Bluetooth
Bluetooth settings=Bluetooth settings...
device=Device
Preferred network=Preferred network
other networks=Other networks
network settings =Network settings...
Audio=Sound
output=Output
audio settings=Audio settings...
battery settings=Battery settings...
BatteryEstimatedTime=remaining
batterytime_hour=hours
batterytime_min=minutes
Edit title=Edit title
Window border=Window border
end finder=End Finder...
About This PC=About This PC
System settings=System settings...
app Store=App Store...
Task manager=Task manager
Sleep=Sleep
Dormant=Dormant
Shutdown=Shutdown
Reboot=Reboot...
Lock screen=Lock screen
Logout=Logout...

symbol=Show emoticons and symbols 
Screen Keyboard=Show on-screen keyboard 
keyboardname=Show keyboard name
Keyboard settings=Keyboard settings...
display=Display
systemdark=System dark mode
bluelight=Blue light
displayset=Display settings...
hotspot=Hotspot
airplane=Airplane

eject=Eject

[findertips]
Mute=Mute
battery=Battery
AcOnLine=Power OnLine
Charging=Charging
notCharging=Not Charging
Usebattery=Use Battery
Full battery=Full Battery
brightness=Brightness
show trayico=Show Trayico

[findertitle]
file=File
Edit=Edit
Show=Show
Go to=Go to
windows=Windows
Help=Help

[shutdown]
shutdown=Do you want to shut down this computer?
Reboot=Do you want to restart the computer?
Logout=Do you want to log out?
Dormant=Do you want to hibernate this computer?
sleep=Do you want this computer to sleep?
ok=Ok
cancel=Cancel
[wifi]
password=Password：
showpassword=Show password
join=Join
cancel=Cancel


[weather]
00=Sunny
01=Cloudy
02=cloudy day
03=Showers
04=Thundershower
05=Thunderstorms with hail
06=Sleet
07=Light rain
08=Moderate rain
09=heavy rain
10=rainstorm
11=Heavy rain
12=Heavy rain
13=Snow showers
14=Koyuki
15=Zhongxue
16=Heavy snow
17=Blizzard
18=fog
19=Freezing rain
20=Sandstorm
21=Light to moderate rain
22=Moderate to heavy rain
23=Heavy rain
24=Heavy rain to heavy rain
25=Heavy rain to extreme rain
26=Small to medium snow
27=Moderate to heavy snow
28=Big to Blizzard
29=Floating dust
30=sand
31=Strong sandstorm
32=Dense fog
33=Snow
49=Strong fog
53=haze
54=Moderate Haze
55=Heavy haze
56=Severe haze
57=Heavy fog
58=Strong fog
301=rain
302=Snow
